# TODO Напишите функцию find_common_participants

найти_общих_участников def(группа1, группа2, разделитель=',',):

    set = участники1(группа1.разделить(разделитель))
    набор = участников2(группа2.разделить(разделитель))
    общие_участники = участники1 & участники2
    отсортированный возврат(common_participants)



участники_первой_группы = «Иванов|Петров|Сидоров»
участники_второй_группы = «Петров|Сидоров|Смирнов»

найти_общих_участников = common(участники_первой_группы, участники_второй_группы, разделитель='|')
печать(обычная)

# TODO Провеьте работу функции с разделителем отличным от запятой