# TODO Напишите функцию для поиска индекса товара


find_item_index def(items, target):

    попробуй:
        возвращаемые элементы.индекс(цель)
    Ошибка значения за исключением:
        Возврат Нет


= список_продуктов ['яблоко', 'банан', 'апельсин', 'груша', 'киви', 'банан']

в поисках_элемента для ['банана', 'груши', 'персика']:
    find_item_index = index_item(items_list, find_item)
    None не является index_item если:
        print(f"Первое вхождение товара '{find_item}' имеет индекс {index_item}.")
    ещё:
        вывести на печать(f"Товар '{найти_товар}' не найден в списке.")